/*


4. *(за бажанням) Задане значення змінної isLogin (залогінився користувач чи ні).
Сформувати header наступним чином:
зліва - логотип (зображення на ваш смак). Класично лого є посиланням на головну сторінку.
справа - або кнопки Login та Register (якщо користувач не залогінився)
                або фото і ім'я користувача (якщо користувач залогінився)
*додатково застилізувати фото користувача: за значанням isMale для чоловіка зробити синю рамку, для жінки червону, при незаданому значенні isMale - сіру.
Примітки:
змінні, які не мають змінюватися впродовж роботи скрипта, оголошувати як const.
де доречно, використовувати тернарний оператор, шаблонний літерал.
при рогзалуженнях тестувати коректність роботи кожної гілки (+ граничні значення, якщо вони є).
замість порівняння isSomething === false прописувати !isSomething.

* * * * * * * * * * * * * * * * * * * * * * * * * *

📋 Завдання на switch..case

Познайомитись з оператором множинного вибору
switch..case
-- альтернативою для
if (умова1)
    інструкція1
else if (умова2)
    інструкція2
else if (умова3)
    інструкція3
...
else
    інструкція

1. Запитати у користувача номер дня тижня та вивести відповідну повну рядкову назву (наприклад, якщо користувач вводить 7 – виводиться повідомлення "неділя"). Передбачити обробку помилкового введення номера дня тижня (в гілка default, з повідомленням "дня з таким номером не існує").

2. (за бажанням) У змінній day лежить якесь число з інтервалу від 1 до 31. Визначте, до якої декади місяця потрапляє це число (до першої, другої чи третьої). Наприклад, число 1 - це перша декада, 20 - друга, 25 - третя.*/

//1
const isDay = true;
if (isDay) {
  document.write(`<h2>Cвітла тема</h2>`);
} else {
  document.write(`<h2 class="night">Темна тема</h2>`);
}

//2
const isOnline = false;
if (!isOnline) {
  alert(
    "Ваше повідомлення буде відправлено при під'єднанні до мережі Інтернет"
  );
}

//3
const price = Number(prompt("Введіть суму покупки: "));

if (price > 500 && price <= 800) {
  alert("Вітаємо у вас знижка 3%");
  const sum = price - (price * 3) / 100;
  alert("Сума вашого замовлення враховуючи знижку " + sum + "грн");
} else if (price > 800) {
  alert("Вітаємо у вас знижка 5%");
  const sum = price - (price * 5) / 100;
  alert("Сума вашого замовлення враховуючи знижку " + sum + "грн");
} else {
  alert("Сума вашого замовлення " + price + "грн");
}
